In [1]:
import pandas as pd

In [2]:
# open hdf5 file for reading
hdf = pd.HDFStore('hdf5_pandas.h5',mode='r')

In [3]:
hdf.keys()

['/DF2Key']

In [6]:
df2 = hdf.get('/DF2Key')

In [7]:
type(df2)

pandas.core.frame.DataFrame

In [8]:
df2.head()

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
2  Tripoli  1st      39      55
3     Rome  2nd      41      70
4     Rome  1st      38      64

In [50]:
hdf.close()

In [9]:
df1

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
2  Tripoli  1st      39      55
3     Rome  2nd      41      70
4     Rome  1st      38      64
5  Tripoli  2nd      44      77
6     Rome  1st      34      45
7   Sydney  2nd      54      66
8   Sydney  1st      61      72